### CONTENTS

- pandas Introduction
- Creating Series data
- creating Data Frames
- Acessing data from series/DataFrame
- Reading Data From environment
- Explore data
- convert data from json to csv etc..

### Pandas introduction
- Developed in 2008 by mckiney
- Used for analyzing.cleaning ,exploring,and manipulating data ## Pandas can do
- finding the correlation
- handling with missing values
- avg,max,min
- plotting

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\sravani\anaconda3\lib\site-packages (1.0.5)
Note: you may need to restart the kernel to use updated packages.Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\sravani\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\sravani\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\sravani\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: six>=1.5 in c:\users\sravani\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

In [5]:
import pandas as pd
pandas.__version__

'1.0.5'

### Series
- list
- tuple
- numpy array

In [7]:
s1=pd.Series([1,2,3,"a"])
print(s1)
print(type(s1))

0    1
1    2
2    3
3    a
dtype: object
<class 'pandas.core.series.Series'>

In [8]:
s1=pd.Series([1,2,3,"a"],index=['x1','x2','x3','x4'])
print(s1)
print(type(s1))

x1    1
x2    2
x3    3
x4    a
dtype: object
<class 'pandas.core.series.Series'>

In [9]:

## Series object with tuple format
s2=pd.Series((1,2,3,4))
print(s2)
s2.index=[11,12,13,14]
s2

0    1
1    2
2    3
3    4
dtype: int64

11    1
12    2
13    3
14    4
dtype: int64

In [10]:
## Series object with numpy array
import numpy as np
s3=pd.Series(np.arange(1,10))
print(s3)
print(type(s3))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32
<class 'pandas.core.series.Series'>

In [11]:

s1.index

Index(['x1', 'x2', 'x3', 'x4'], dtype='object')

In [12]:
s2.index

Int64Index([11, 12, 13, 14], dtype='int64')

In [14]:
s3.index

RangeIndex(start=0, stop=9, step=1)

In [15]:
s1

x1    1
x2    2
x3    3
x4    a
dtype: object

In [16]:
s1['x2']

2

In [17]:
s1['x1'],s1['x3']

(1, 3)

In [18]:
s3.min()

1

In [19]:

s3.cumsum()

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
dtype: int32

### Pandas Date_range

- To work with data and time formates we can use date_range
- pandas.date_range()

In [21]:
import pandas as pd
d1=pd.date_range('01-01-2021',periods=10)
d1

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [22]:
d2=pd.date_range('01-01-2021',periods=20,freq='1h')
d2

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00', '2021-01-01 05:00:00',
               '2021-01-01 06:00:00', '2021-01-01 07:00:00',
               '2021-01-01 08:00:00', '2021-01-01 09:00:00',
               '2021-01-01 10:00:00', '2021-01-01 11:00:00',
               '2021-01-01 12:00:00', '2021-01-01 13:00:00',
               '2021-01-01 14:00:00', '2021-01-01 15:00:00',
               '2021-01-01 16:00:00', '2021-01-01 17:00:00',
               '2021-01-01 18:00:00', '2021-01-01 19:00:00'],
              dtype='datetime64[ns]', freq='H')

In [23]:
d2=pd.date_range('01-01-2021',periods=20,freq='24h')
d2

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20'],
              dtype='datetime64[ns]', freq='24H')

In [25]:
d2=pd.date_range(start='01-01-2021',end='01-02-2021',freq='5s')
d2

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:00:05',
               '2021-01-01 00:00:10', '2021-01-01 00:00:15',
               '2021-01-01 00:00:20', '2021-01-01 00:00:25',
               '2021-01-01 00:00:30', '2021-01-01 00:00:35',
               '2021-01-01 00:00:40', '2021-01-01 00:00:45',
               ...
               '2021-01-01 23:59:15', '2021-01-01 23:59:20',
               '2021-01-01 23:59:25', '2021-01-01 23:59:30',
               '2021-01-01 23:59:35', '2021-01-01 23:59:40',
               '2021-01-01 23:59:45', '2021-01-01 23:59:50',
               '2021-01-01 23:59:55', '2021-01-02 00:00:00'],
              dtype='datetime64[ns]', length=17281, freq='5S')

In [26]:
date=pd.Series(pd.date_range(start='01-01-2021',end='01-02-2021',freq='5s'))
print(date)
print(type(date))

0       2021-01-01 00:00:00
1       2021-01-01 00:00:05
2       2021-01-01 00:00:10
3       2021-01-01 00:00:15
4       2021-01-01 00:00:20
                ...
17276   2021-01-01 23:59:40
17277   2021-01-01 23:59:45
17278   2021-01-01 23:59:50
17279   2021-01-01 23:59:55
17280   2021-01-02 00:00:00
Length: 17281, dtype: datetime64[ns]
<class 'pandas.core.series.Series'>

### Data Frame
- pandas DataFrame
- tuple
- list
- dict
- numpy array
     - String,float,complex-str/object

In [2]:
import pandas as p1
import numpy as np
df1 = p1.DataFrame([[1,2,3],[4,5,'A']])
df2 = p1.DataFrame((1,3),(1,2))
df3 = p1.DataFrame({"k1":[11,12],"m1":[23,33]})
df4 = p1.DataFrame(np.array([[1,3,5],[8,7,6]]))

In [3]:
df1

   0  1  2
0  1  2  3
1  4  5  A

In [4]:
df2

   0
1  1
2  3

In [5]:
df3

   k1  m1
0  11  23
1  12  33

In [6]:
df4

   0  1  2
0  1  3  5
1  8  7  6

In [9]:
import numpy as np
d1={"rollno":['18JG1A05'+str(i) for i in range(1,101)], 
             'm1':np.random.randint(1,100,100),
             'm2':np.random.randint(1,100,100),
             'm3':np.random.randint(1,100,100)}
df = p1.DataFrame(d1)
df

         rollno  m1  m2  m3
0     18JG1A051  64  83  12
1     18JG1A052  68  70  27
2     18JG1A053  25   9  72
3     18JG1A054  16  78  49
4     18JG1A055   5  99  68
..          ...  ..  ..  ..
95   18JG1A0596  90  64  45
96   18JG1A0597  53  46  69
97   18JG1A0598   2  16  52
98   18JG1A0599  64   7  85
99  18JG1A05100  71  80  39

[100 rows x 4 columns]

In [11]:
df.head()

      rollno  m1  m2  m3
0  18JG1A051  64  83  12
1  18JG1A052  68  70  27
2  18JG1A053  25   9  72
3  18JG1A054  16  78  49
4  18JG1A055   5  99  68

In [13]:
df.head(10)

       rollno  m1  m2  m3
0   18JG1A051  64  83  12
1   18JG1A052  68  70  27
2   18JG1A053  25   9  72
3   18JG1A054  16  78  49
4   18JG1A055   5  99  68
5   18JG1A056  46  45  27
6   18JG1A057   9  10  29
7   18JG1A058  42  64  30
8   18JG1A059  73  12  20
9  18JG1A0510  72  48   2

In [12]:
df.tail()

         rollno  m1  m2  m3
95   18JG1A0596  90  64  45
96   18JG1A0597  53  46  69
97   18JG1A0598   2  16  52
98   18JG1A0599  64   7  85
99  18JG1A05100  71  80  39

In [15]:
df.shape

(100, 4)

### Accessing data from DataFrame

- Index
- Slicing

In [16]:
df.head()

      rollno  m1  m2  m3
0  18JG1A051  64  83  12
1  18JG1A052  68  70  27
2  18JG1A053  25   9  72
3  18JG1A054  16  78  49
4  18JG1A055   5  99  68

In [23]:
df['rollno']

0       18JG1A051
1       18JG1A052
2       18JG1A053
3       18JG1A054
4       18JG1A055
         ...
95     18JG1A0596
96     18JG1A0597
97     18JG1A0598
98     18JG1A0599
99    18JG1A05100
Name: rollno, Length: 100, dtype: object

In [24]:
df['m1']

0     64
1     68
2     25
3     16
4      5
      ..
95    90
96    53
97     2
98    64
99    71
Name: m1, Length: 100, dtype: int32

### iloc
- index 

### loc
- label

In [25]:
df.iloc[0]

rollno    18JG1A051
m1               64
m2               83
m3               12
Name: 0, dtype: object

In [26]:
df.iloc[0:10]

       rollno  m1  m2  m3
0   18JG1A051  64  83  12
1   18JG1A052  68  70  27
2   18JG1A053  25   9  72
3   18JG1A054  16  78  49
4   18JG1A055   5  99  68
5   18JG1A056  46  45  27
6   18JG1A057   9  10  29
7   18JG1A058  42  64  30
8   18JG1A059  73  12  20
9  18JG1A0510  72  48   2

In [27]:
df.iloc[90:]

         rollno  m1  m2  m3
90   18JG1A0591  77   3  22
91   18JG1A0592  90  86  13
92   18JG1A0593  16  35  78
93   18JG1A0594   4  20  97
94   18JG1A0595  84  55  50
95   18JG1A0596  90  64  45
96   18JG1A0597  53  46  69
97   18JG1A0598   2  16  52
98   18JG1A0599  64   7  85
99  18JG1A05100  71  80  39

In [28]:
df.iloc[::-1]

         rollno  m1  m2  m3
99  18JG1A05100  71  80  39
98   18JG1A0599  64   7  85
97   18JG1A0598   2  16  52
96   18JG1A0597  53  46  69
95   18JG1A0596  90  64  45
..          ...  ..  ..  ..
4     18JG1A055   5  99  68
3     18JG1A054  16  78  49
2     18JG1A053  25   9  72
1     18JG1A052  68  70  27
0     18JG1A051  64  83  12

[100 rows x 4 columns]

In [29]:
df.iloc[0:10][['rollno','m1']]

       rollno  m1
0   18JG1A051  64
1   18JG1A052  68
2   18JG1A053  25
3   18JG1A054  16
4   18JG1A055   5
5   18JG1A056  46
6   18JG1A057   9
7   18JG1A058  42
8   18JG1A059  73
9  18JG1A0510  72

In [30]:
student_df = df.set_index("rollno")
student_df.head()

           m1  m2  m3
rollno
18JG1A051  64  83  12
18JG1A052  68  70  27
18JG1A053  25   9  72
18JG1A054  16  78  49
18JG1A055   5  99  68

In [31]:
student_df.loc['18JG1A0551']

m1    49
m2    23
m3    50
Name: 18JG1A0551, dtype: int32

In [33]:
student_df.loc['18JG1A0551']['m1']

49

In [34]:
student_df.loc['18JG1A0551':]

             m1  m2  m3
rollno
18JG1A0551   49  23  50
18JG1A0552   53  28  24
18JG1A0553   17  44  15
18JG1A0554   85  10  31
18JG1A0555   55  57  86
18JG1A0556   65  15  97
18JG1A0557   11  83   9
18JG1A0558   27  49  22
18JG1A0559   88  42  28
18JG1A0560   79  72  97
18JG1A0561   47   4  64
18JG1A0562   63  36  72
18JG1A0563   31  37  15
18JG1A0564    2  12  40
18JG1A0565   84  23  98
18JG1A0566   75  48  98
18JG1A0567    8  31  58
18JG1A0568   33  26  74
18JG1A0569   24  95  12
18JG1A0570   80  23  55
18JG1A0571    3  85  93
18JG1A0572   74  21  13
18JG1A0573   56  87  22
18JG1A0574   35  68  62
18JG1A0575   82  13  48
18JG1A0576   19  20  54
18JG1A0577   95  21  28
18JG1A0578   67  89  37
18JG1A0579   47  86  47
18JG1A0580   40  26  90
18JG1A0581   66  74  96
18JG1A0582   80  25  81
18JG1A0583   99  36  17
18JG1A0584    8  24  95
18JG1A0585    2  12  46
18JG1A0586   76  77  88
18JG1A0587   85  72  45
18JG1A0588   55  15  11
18JG1A0589   63  27  23
18JG1A0590   74  47  92
18JG1A0591   77   3  22
18JG1A0592   90  86  13
18JG1A0593   16  35  78
18JG1A0594    4  20  97
18JG1A0595   84  55  50
18JG1A0596   90  64  45
18JG1A0597   53  46  69
18JG1A0598    2  16  52
18JG1A0599   64   7  85
18JG1A05100  71  80  39

In [44]:
student_df["sum_columns"]= student_df.sum(axis='columns')
student_df["sum_m1"]= student_df['m1'].sum()
student_df.head()

           m1  m2  m3  sum_m1  sum_columns
rollno
18JG1A051  64  83  12    4985        954.0
18JG1A052  68  70  27    4985        990.0
18JG1A053  25   9  72    4985        636.0
18JG1A054  16  78  49    4985        858.0
18JG1A055   5  99  68    4985       1032.0

In [41]:
64+83+12

159